{
  "image": "results/images/annotated/annotated_raw_geometry_line_0005.png",
  "question": "Determine the length of Line_A_F0 in the figure.",
  "qt_description": "Line Line_A_F0 (New: True, Expr Length: 11) (Desc: Draw perpendicular from point A to line L1 (foot F0 on segment))",
  "description": "原始图形描述: Base shape is a regular 3-sided polygon (center O1) with side length 7, rotation angle 0 radians. Total 1 derivation rounds. Round 1: applying 'circum_inscribe' rule. Circumscribed circle (center O1) around 3-sided polygon. Found 4 total points (including intersections). Geometry finalized: 0 new lines and 3 new arcs generated by splitting. Total lines: 3, total arcs: 4, total points: 4.\n增强结果序号: 4/4\n本结果操作轮数: 1\n第 1 轮操作（共 1 步）:\n  第 1 步: Draw perpendicular from point A to line L1 (foot F0 on segment)",
  "gt": {
    "expr": "7*sqrt(3)/2",
    "latex": "\\frac{7 \\sqrt{3}}{2}",
    "value": 6.06217783
  },
  "level": 2,
  "generated_question": [
    "In the given figure, a regular triangle with side length 7 is inscribed in a circle centered at O1. Point A is one vertex of the triangle, and line L1 is the side opposite A. A perpendicular is drawn from point A to line L1, intersecting it at point F0. Determine the length of segment AF0."
  ],
  "generated_answer": [
    "We are given a **regular triangle** (equilateral triangle) with side length 7, inscribed in a circle centered at **O1**. Point **A** is one vertex of the triangle, and **line L1** is the side **opposite** to A — that is, the side connecting the other two vertices, say **B** and **C**. A perpendicular is drawn from **A** to line **L1**, intersecting it at point **F0**. We are to find the length of segment **AF0**.\n\n---\n\n### Step 1: Understand the Geometry\n\nIn an **equilateral triangle**, all sides are equal (7 units), and all angles are 60°. The perpendicular from a vertex to the opposite side is also the **altitude**, **median**, and **angle bisector** — due to symmetry.\n\nSo, **AF0** is the **altitude** of the equilateral triangle from vertex A to side BC (which is line L1).\n\n---\n\n### Step 2: Formula for Altitude of an Equilateral Triangle\n\nFor an equilateral triangle with side length $ s $, the altitude $ h $ is given by:\n\n$$\nh = \\frac{\\sqrt{3}}{2} s\n$$\n\nThis comes from splitting the equilateral triangle into two 30-60-90 right triangles. In such a triangle, the sides are in the ratio $ 1 : \\sqrt{3} : 2 $, where the side opposite 60° is $ \\frac{\\sqrt{3}}{2} \\times \\text{hypotenuse} $.\n\n---\n\n### Step 3: Plug in the Side Length\n\nGiven $ s = 7 $, we compute:\n\n$$\nAF0 = \\frac{\\sqrt{3}}{2} \\times 7 = \\frac{7\\sqrt{3}}{2}\n$$\n\n---\n\n### Step 4: Final Answer\n\nThis is the exact value. We can leave it in exact form unless a decimal approximation is requested — the problem does not specify, so we provide the exact value.\n\n---\n\n### ✅ Final Answer:\n\n$$\n\\boxed{\\frac{7\\sqrt{3}}{2}}\n$$"
  ],
  "answer_validity": [
    true
  ]
}