{
  "image": "results/images/annotated/annotated_raw_geometry_line_0028.png",
  "question": "Determine the radian measure of the angle formed by Line_A_B and Line_E_A at A.",
  "qt_description": "Angle B-A-E formed by Line_A_B and Line_E_A at vertex A. Calculated using vector dot product (non-standard radian form).",
  "description": "原始图形描述: Base shape is a regular 5-sided polygon (center O1) with side length 5, rotation angle pi/5 radians. Total 2 derivation rounds. Round 1: applying 'circum_inscribe' rule. Circumscribed 5-sided polygon (center O1). Round 2: applying 'circum_inscribe' rule. Inscribed 5-sided polygon (center O1). Found 11 total points (including intersections). Geometry finalized: 0 new lines and 0 new arcs generated by splitting. Total lines: 10, total arcs: 0, total points: 11.\n增强操作总轮数: 0",
  "gt": {
    "expr": "acos(sqrt(6 - 2*sqrt(5))*(-sqrt(sqrt(5) + 5)/2 + sqrt(5 - sqrt(5))/2)/sqrt(-10*sqrt(5) - 3*sqrt(5 - sqrt(5))*sqrt(sqrt(5) + 5) + sqrt(5)*sqrt(5 - sqrt(5))*sqrt(sqrt(5) + 5) + 30))",
    "latex": "\\operatorname{acos}{\\left(\\frac{\\sqrt{6 - 2 \\sqrt{5}} \\left(- \\frac{\\sqrt{\\sqrt{5} + 5}}{2} + \\frac{\\sqrt{5 - \\sqrt{5}}}{2}\\right)}{\\sqrt{- 10 \\sqrt{5} - 3 \\sqrt{5 - \\sqrt{5}} \\sqrt{\\sqrt{5} + 5} + \\sqrt{5} \\sqrt{5 - \\sqrt{5}} \\sqrt{\\sqrt{5} + 5} + 30}} \\right)}",
    "is_standard_radian": false
  },
  "api_results": [
    "Consider a regular pentagon centered at point O1 with side length 5, rotated by π/5 radians. Through two successive applications of the “circum_inscribe” rule — first circumscribing a larger pentagon about the original, then inscribing a smaller pentagon within it — a composite figure is formed containing 11 labeled points (A through J and O1) and 10 line segments. No new lines or arcs were added during finalization. Point A is a vertex shared by the outermost and innermost pentagons, with segments AB and AE emanating from it. \n\nDetermine the radian measure of the angle ∠BAE formed at vertex A by the line segments AB and AE, using vector dot product methods. Express your answer in exact non-decimal radian form."
  ]
}