{
  "image": "results/images/annotated/annotated_raw_geometry_line_0032.png",
  "question": "Find the radian expression for angle B-A-E.",
  "qt_description": "Angle B-A-E formed by Line_A_B and Line_E_A at vertex A. Calculated using vector dot product (non-standard radian form).",
  "description": "原始图形描述: Base shape is a regular 5-sided polygon (center O1) with side length 5, rotation angle pi/5 radians. Total 2 derivation rounds. Round 1: applying 'circum_inscribe' rule. Circumscribed 5-sided polygon (center O1). Round 2: applying 'circum_inscribe' rule. Inscribed 5-sided polygon (center O1). Found 11 total points (including intersections). Geometry finalized: 0 new lines and 0 new arcs generated by splitting. Total lines: 10, total arcs: 0, total points: 11.\n增强操作总轮数: 1\n第 1 轮操作（共 1 步）:\n  第 1 步: Connect points J and H (both on segments)",
  "gt": {
    "expr": "acos(sqrt(6 - 2*sqrt(5))*(-sqrt(sqrt(5) + 5)/2 + sqrt(5 - sqrt(5))/2)/sqrt(-10*sqrt(5) - 3*sqrt(5 - sqrt(5))*sqrt(sqrt(5) + 5) + sqrt(5)*sqrt(5 - sqrt(5))*sqrt(sqrt(5) + 5) + 30))",
    "latex": "\\operatorname{acos}{\\left(\\frac{\\sqrt{6 - 2 \\sqrt{5}} \\left(- \\frac{\\sqrt{\\sqrt{5} + 5}}{2} + \\frac{\\sqrt{5 - \\sqrt{5}}}{2}\\right)}{\\sqrt{- 10 \\sqrt{5} - 3 \\sqrt{5 - \\sqrt{5}} \\sqrt{\\sqrt{5} + 5} + \\sqrt{5} \\sqrt{5 - \\sqrt{5}} \\sqrt{\\sqrt{5} + 5} + 30}} \\right)}",
    "is_standard_radian": false
  },
  "api_results": [
    "Consider a regular pentagon centered at point O₁ with side length 5, rotated by π/5 radians. Through two rounds of circum-inscribing operations (first circumscribing, then inscribing), a nested geometric configuration is formed, yielding 11 labeled points: A, B, C, D, E, F, G, H, I, J, and O₁. After finalizing the geometry — with no new lines or arcs added by splitting — a total of 10 line segments remain. In the first enhancement round, segment JH is explicitly drawn, connecting two points lying on existing segments.\n\nGiven this configuration, find the radian measure of angle ∠BAE — the angle formed at vertex A between segments AB and AE — using the vector dot product method. Express your answer in exact radian form, without decimal approximation."
  ]
}